#Controller
#root wait time 0.1 second (100/1000=0.1)
waitTime = 100
#creat Pid time out time 5 miniter (300000/(1000*60)=5)
timeoutTime = 300000
#load time out time 5 miniter (300000/(1000*60)=5)
lockTimeoutTime = 300000
#task time out time 5 miniter (300/60=5)
taskTimeoutTime = 30000

#Controller
pid_max_count=5

#Ubmatrix url
UB_taxonomy_url=http://www.ubmatrix.com/2005/function/taxonomy
UB_dts_url=http://www.ubmatrix.com/2005/function/dts
#guopeng addon of ddts uri
UB_ddts_url=http://www.ubmatrix.com/2005/function/dimension/dts
UB_linkbase_url=http://www.ubmatrix.com/2005/function/linkbase
UB_basiccalculation_url=http://www.UBmatrix.com/Patterns/BasicCalculation

#xbrl url
xbrl_instance_url=http://www.xbrl.org/2003/instance
xbrl_link_role=http://www.xbrl.org/2003/role/link
xbrl_parent_child_url=http://www.xbrl.org/2003/arcrole/parent-child
xbrl_concept_label_url=http://www.xbrl.org/2003/arcrole/concept-label

#w3 url
w3_xmlschema_url=http://www.w3.org/2001/XMLSchema
w3_xlink_url=http://www.w3.org/1999/xlink

#name space
name.space.iso.4217=http://www.xbrl.org/2003/iso4217
name.space.instance=http://www.xbrl.org/2003/instance
name.space.xhtml=http://www.w3.org/1999/xhtml

#guopeng addon and modification
local_rule_file_path=../RuleSet.xml

local_validation_file_path=../validation

xbrl_license_path=../properties/XBRL_Module_License.property

xbrl_version_path=../properties/XBRL_Module_Version.property

xbrl_log_path=../logs/XBRLComponentLog.txt

taxonomy_entry_point_file=../taxonomy/ChinaTelecom/ChinaTelcom.xsd
#guopeng addon and modification(ended here)

#local log print flag
local_log_flag=true

#custom setup of user
label_local = en
label_default_role = http://www.xbrl.org/2003/role/label

#mapping file name
FootnoteData = FootnoteData.xml
UnitData=UnitData.xml
EnvData=EnvData.xml
FactData=FactData.xml
FactMapping=FactMapping.xml
ContextData=ContextData.xml
ContextMapping=ContextMapping.xml
NodeData=NodeData.xml
LineItemMapping=LineItemMapping.xml
AxisData=AxisData.xml

#msg list
WB_00001=Invalid data in instance document.
WB_00002=Multiple values of element({0},{1},{2},{3},{4})
WB_00003=Failed in getting preview data without presentation linkbase.
WB_00004=Failed in creating fact data ({1}) without element value ({0}).
WB_00005=An error in creating preview data.
WB_00006=Language is set null with no definition from the user.
WB_00007=Failed in creating {0} fact data, because {1} isn't numerical.
WB_00008=Failed in I/F xml file, because {1} cann't repetitive . Please check the xml file
WB_00009=The {0} : {1} in FactData but not in {2} . Please check the xml file
WB_00010=The fact {0}'s elementId contextId and unitId are repeatted. Please check the xml file
WB_00011=The footnoteData file doesn't exist.It may cause footnode information lost in the instance file.
WB_00012=Failed in creating tuple.
WB_00013=unit is set to the data of stringItemType.elementId:{0},contextId:{1},unitId:{2}
WB_00014=Nil={0} is set to the element of nillable={1}. elementId:{2}
WB_00015=The character string is set to the element of monetaryItemType. elementId:{0},contextId:{1},unitId:{2}
WB_00016=1024 or more characters cannot be set to the data of stringItemType. elementId:{0}
WB_00017=periodType of nodeData and period of contextData are not in agreement. elementId:{0},contextId:{1},unitId:{2}
EB_00001=Failed in starting the XBRL Component.
EB_00002=Time out error. Failed in getting the process id.
EB_00004=Process id doesn't exist.
EB_00005=Failed in finding the taxonomy file. Please check the file name.
EB_00006=An unexpected error in reading the taxonomy file.
EB_00007=Failed in finding the mapping file. Please check the mapping file name.
EB_00008=An unexpected error in reading the xml file. The file name is:{0}.
EB_00011=An unexpected error in output of the instance document.
EB_00013=An unexpected error in output of the taxonomy.
EB_00014=An error in the stop process.
EB_00015=Time out error.
EB_00016=The process was interrupted.
EB_00017=An error in checking the input value.
EB_00018=Necessary items are insufficient.
EB_00019=Multiple periods.
EB_00022=Failed in creating an instance document without the taxonomy and mapping files.
EB_00023=Failed in reading values from the property file.
EB_00024=Failed in creating elements without the taxonomy file.
EB_00025=Reading the taxonomy file should be after starting the component.
EB_00026=Reading the mapping file should be after reading the taxonomy file.
EB_00027=An internal error.
EB_00028=Failed in finding the license request file. Please check the file name.
EB_00029=Faild in finding the XBRL version file. Please check the file name
EB_00030=An error in reading the XBRL version file.
EB_00031=An error in writing the instance file.
EB_00032=Multiple units. An processing exception.
EB_00033=Setting language should be after getting taxonomy file.
#VERUP guopeng add start
EB_00034=An error has occurred when creating the dimension information.
EB_00035=An error has occurred when creating the schema node information.
EB_00036=An error has occurred when trying to get the dimension information.
EB_00037=The start time is later than the end time.
EB_00038=An error has occurred when generating the node data.
EB_00039=Failed in generating the node data without the taxonomy file.
#guopeng add end
EB_00040=UnitData has no numerator, only has the denominator.
EB_00041=The license is Illegal.
EB_00042=Reading the NodeData file should be after reading the mapping file.
EB_00043=Reading the FactData file should be after reading the NodeData file.
EB_00044=Reading the ContextData file should be after reading the FactData file.
EB_00045=Reading the FootnoteData file should be after reading the ContextData file.
EB_00046=Reading the UnitData file should be after reading the FootnoteData file.
EB_00047=The input file {0} is not consistent.
EB_00048=Reading the EnvData file should be after reading the UnitData file.
EB_00049=The numeratorMeasure or denominatorMeasure in UnitData file can not be multiple. The unitId = {0}.
EB_00050=Failed to create the node data because there may be loops in the taxonomy definition.
#VERUP guopeng add start
EB_00051=Failed in generating the node data information.
#guopeng add end
EB_00099=A system error (java error).

#msg2 list
WB2_00001=Failed in getting the presentation.
WB2_00002=scenariList and segmentList exist.
WB2_00003=The fact {0} is not tuple type.
WB2_00004=The fact {0} is multiple tuple.
WB2_00005=By condition (elementId = {0}), (hypercube = {1}) failed to find NodeData.xml.
EB2_00001=Failed in starting the XBRL Component.
EB2_00002=Time out error. Failed in getting the process id.
EB2_00004=Process id doesn't exist.
EB2_00005=Failed in finding the instance file. Please check the file name.
EB2_00006=A system error.  An invalid instance.
EB2_00007=An unexpected error in importing the instance file.
EB2_00008=Failed in finding the mapping file. Please check the file name.
EB2_00009=The mapping file does not match.
EB2_00010=An unexpected error in reading the mapping file.
EB2_00011=An unexpected error in putting out the instance file.
EB2_00012=Failed in finding the taxonomy file. Please check the file name.
EB2_00013=An unexpected error in creating a taxonomy list.
EB2_00014=Failed in stopping the process.
EB2_00015=Time out error.
EB2_00016=The process was interrupted.
EB2_00017=An error in checking the input value.
EB2_00027=An internal error.
EB2_00028=Failed in finding the license request file. Please check the file name.
EB2_00029=Failed in finding the XBRL version file. Please check the file name.
EB2_00030=An error in reading the XBRL version file.
EB2_00031=Loading the instance file should be after starting the component.
EB2_00032=Obtaining the taxonomy path should be after loading the instance file.
EB2_00033=Redesignating taxonomy should be after reading an instance file.
EB2_00034=Reading the mapping file should be after reading the instance file.
EB2_00035=The output of the instance should be after reading the mapping file.
EB2_00036=The output of context should be after reading the mapping file.
EB2_00037=Designating parent should be after the output of context.
EB2_00038=An unexpected error in the output of context.
EB2_00039=An unexpected error in getting parent designated by user.
EB2_00040=Incorrect instance document without referrence to a taxonomy.
EB2_00041=System error. Inconsistent process ID.
EB2_00044=Output of the preview data should be after load of the instance file.
EB2_00045=Output of path could not found or other exception happened.
EB2_00046=XML file is not valid.
EB2_00047=same key of the FactBean.
EB2_00048=UnitData no numerator, only the denominator.
EB2_00049=The license is Illegal.
EB2_00050=nodeDataSignature of NodeData.xml and AxisData.xml is not the same.
EB2_00051=hyperCube of the context does not exist in AxisData.xml.
EB2_00052=measure of UnitData are multiple.
EB2_00053=Reading the nodedata file should be after reading the instance file.
EB2_00054=An unexpected error in reading the nodedata or axisdata file.
EB2_00099=A system error ( java error).

#msg3 list for instance validaition
EB3_00001=Failed in loading the rule set file.
EB3_00002=An internal error.(when trying to instantiate the validation class)
EB3_00003=An internal error.(the validation class may not be correctly configured)
EB3_00004=The specified validation class does not exist.Please check your local configuration.
EB3_00005=An error occurred when validate the specified instance file.
EB3_00006=Failed in loading the validation configuration file.(The file may not be correctly configured, or not found in the specified directory.)
EB3_00007=Reading the validation configuration file should be after starting the component.
EB3_00008=Duplicate of the vRuleSetDesc tag.
EB3_COREEX=An error has occurred when performing a DTS-requested validation.
EB3_FILENOTFOUNDEX=The specified XML based file does not exist.
EB3_SAXEX=A SAX exception has occurred when trying to parse an XML document.
EB3_IOEX=An I/O error when trying to access a file.
EB3_FORMATTEREX=A formatter error has occurred when trying to validate the specified instance file.
EB3_XPEVALIDATIONEX=An error has occurred when trying to validate the specified instance file with the XPE validation functions.
EB3_GENERALEX=A general error has occurred when trying to validate the specified instance file.

#validation err msg JP
EVA_00001JP=\u8a2d\u5b9a\u60c5\u5831\u306e\u30b9\u30ad\u30fc\u30de\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_00002JP=\u8a2d\u5b9a\u60c5\u5831\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_00003JP=\u8a2d\u5b9a\u60c5\u5831\u30d5\u30a1\u30a4\u30eb\u306e\u5b9a\u7fa9\u304c\u4e0d\u6b63\u3067\u3059\u3002
EVA_00004JP=\u30eb\u30fc\u30eb\u30bb\u30c3\u30c8\u306e\u30b9\u30ad\u30fc\u30de\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_00005JP=\u30eb\u30fc\u30eb\u30bb\u30c3\u30c8\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_00006JP=\u30eb\u30fc\u30eb\u30bb\u30c3\u30c8\u30d5\u30a1\u30a4\u30eb\u306e\u5b9a\u7fa9\u304c\u4e0d\u6b63\u3067\u3059\u3002
EVA_00007JP=\u8a2d\u5b9a\u60c5\u5831\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_00008JP=\u30d0\u30ea\u30c7\u30fc\u30b7\u30e7\u30f3\u5b9f\u65bd\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
EVA_10003JP=\u4e2d\u56fd\u56fd\u5bb6\u6280\u8853\u57fa\u6e96\uff08GB/T25500-2010\uff09\u3001\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u53ca\u3073\u4f01\u696d\u4f1a\u8a08\u57fa\u6e96\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u30ac\u30a4\u30c9\u30e9\u30a4\u30f3\u306e\u8981\u6c42\u3092\u6e80\u305f\u3057\u3066\u3044\u307e\u305b\u3093\u3002
EVA_10004JP=\u6700\u65b0\u7248\u306eXBRL\u56fd\u6280\u8853\u57fa\u6e96\u3068\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u3092\u5143\u306b\u7de8\u96c6\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10005JP=\u63d0\u51fa\u3057\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3068\u30bf\u30af\u30bd\u30ce\u30df\u306e\u30a8\u30f3\u30b3\u30fc\u30c9\u306f\u300cUTF-8\u300d\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10006JP=\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u540d\u524d\u7a7a\u9593\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u30c9\u30e1\u30a4\u30f3\u540d/\u4f1a\u8a08\u57fa\u6e96/\u65e5\u4ed8\uff5d\u3002
EVA_10007JP=\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u62e1\u5f35\u3057\u305f\u30bf\u30af\u30bd\u30ce\u30df\u30b9\u30ad\u30fc\u30de\u3068\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10008JP=\u63d0\u51fa\u3057\u305f\u30bf\u30af\u30bd\u30ce\u30df\u306f\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u3092\u5143\u306b\u62e1\u5f35\u3057\u3001\u76f4\u63a5\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u3078\u306e\u8ffd\u52a0\u3001\u4fee\u6b63\u3001\u524a\u9664\u64cd\u4f5c\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
EVA_10012JP=\u6ce8\u8a18\u306e\u5168\u3066\u306e\u5185\u5bb9\u3092\u4e00\u3064\u306e\u30c6\u30ad\u30b9\u30c8\u30d6\u30ed\u30c3\u30af\uff08XML<text\u3000block>\u30bf\u30b0\uff09\u3067\u8868\u73fe\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10013JP=\u4f1a\u8a08\u653f\u7b56\u53ca\u3073\u4f1a\u8a08\u63a8\u5b9a\u4ed8\u6ce8\u306e\u5404\u9805\u76ee\u3092\u4e00\u3064\u306e\u30c6\u30ad\u30b9\u30c8\u30d6\u30ed\u30c3\u30af\uff08XML<text\u3000block>\u30bf\u30b0\uff09\u3067\u8868\u73fe\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10018JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u30b9\u30ad\u30fc\u30de\u30d5\u30a1\u30a4\u30eb\u540d\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u6cd5\u4eba\u4e2d\u56fd\u8a9e\u540d\u79f0\uff5d-\uff5b\u30d3\u30b8\u30cd\u30b9\u884c\u653f\u7ba1\u7406\u756a\u53f7\uff5d-\uff5b\u65e5\u4ed8\uff5d.xsd\u3002
EVA_10019JP=\u4f01\u696d\u8ca1\u52d9\u5831\u544a\u4e2d\u306e\u30bf\u30a4\u30c8\u30eb\u9805\u76ee\u306f\u3000dataType=stringItemType\u3001abstract=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10020JP=\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u306e\u65e2\u5b58\u9805\u76ee\u304c\u7533\u544a\u8981\u6c42\u3092\u6e80\u305f\u3057\u3066\u3044\u308b\u5834\u5408\u3001\u518d\u5b9a\u7fa9\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
EVA_10024JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306b\u304a\u3044\u3066\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u4f7f\u308f\u306a\u3044\u8981\u7d20\u306f\u5b9a\u7fa9\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10025JP=\u8981\u7d20\u306e\u671f\u9593\u5c5e\u6027\u3068\u8ca1\u52d9\u5831\u544a\u306e\u671f\u9593\u5c5e\u6027\uff08instant/duration\uff09\u306f\u4e00\u81f4\u3055\u305b\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
EVA_10029JP=\u8981\u7d20\u540d\u306f\u3001\u82f1\u8a9e\u6a19\u6e96\u30e9\u30d9\u30eb\u3092\u5143\u306b\u30ad\u30e3\u30e1\u30eb\u30b1\u30fc\u30b9\u547d\u540d\u6cd5\u3067\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10031JP=\u65e2\u5b58\u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u540c\u3058\u540d\u79f0\u306e\u62e1\u5f35\u30a8\u30ec\u30e1\u30f3\u30c8\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
EVA_10032JP=\u5168\u3066\u306e\u8981\u7d20\u306b\u5bfe\u3057\u3066\u3001nillable=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10033JP=Domain\u30e1\u30f3\u30d0\u3092\u9664\u304f\u30d0\u30fc\u30c1\u30e3\u30eb\u8981\u7d20\u306f\u3001type=stringItemType\u3001abstract=true\u3001periodType=duration\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10034JP=substitutionGroup\u306f\u3001dimensionItem\u3001hypercubeItem\u3001item\u306e\u3044\u305a\u308c\u304b\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10035JP=\u30e9\u30d9\u30eb\u306e\u672b\u5c3e\u304c\u201cAxis\u201d\u3067\u7d42\u308f\u308b\u8ef8\u8981\u7d20\u306b\u306f\u3001substitutionGroup=dimensionItem\u3001abstract=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10036JP=\u30e9\u30d9\u30eb\u306e\u672b\u5c3e\u304c\u201cTable\u201d\u3067\u7d42\u308f\u308b\u30c6\u30fc\u30d6\u30eb\u8981\u7d20\u306b\u306f\u3001substitutionGroup=hypercubeItem\u3001abstract=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10037JP=\u30e9\u30d9\u30eb\u306e\u672b\u5c3e\u304c\u201cLineItems\u201d\u3067\u7d42\u308f\u308b\u30e9\u30a4\u30f3\u30a2\u30a4\u30c6\u30e0\u8981\u7d20\u306b\u306f\u3001abstract=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10038JP=\u30e9\u30d9\u30eb\u306e\u672b\u5c3e\u304c \u201cMember\u201d\u3067\u7d42\u308f\u308b\u30c9\u30e1\u30a4\u30f3\u30e1\u30f3\u30d0\u30fc\u8981\u7d20\u306b\u306f\u3001type=domainItem\u3001abstract=true\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10039JP=\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u540d\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u4e2d\u56fd\u8a9e\u540d\u79f0\uff5d-\uff5b\u30d3\u30b8\u30cd\u30b9\u884c\u653f\u7ba1\u7406\u756a\u53f7\uff5d-\uff5b\u65e5\u4ed8\uff5d_\uff5b\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u30bf\u30a4\u30d7\uff5d_\uff5b\u8a00\u8a9e\u30bf\u30a4\u30d7\uff5d.xml
EVA_10040JP=\u4f01\u696d\u304c\u62e1\u5f35\u3057\u305f\u8981\u7d20\u306e\u30e9\u30d9\u30eb\u306b\u3064\u3044\u3066\u306f\u3001\u540c\u4e00\u8a00\u8a9e\u306e\u540c\u4e00\u30ed\u30fc\u30eb\uff08xlink:role\uff09\u3092\u8907\u6570\u5b9a\u7fa9\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10041JP=\u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u540d\u306f\u4e00\u610f\u3067\u3042\u308a\u3001\u8907\u6570\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u540c\u3058\u6a19\u6e96\u30e9\u30d9\u30eb\u3092\u6301\u3064\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10045JP=\u540c\u3058\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u5bfe\u3057\u305f\u30e9\u30d9\u30eb\u30ed\u30fc\u30eb\u306f\u4e2d\u56fd\u8a9e\u3068\u82f1\u8a9e\u306e\u30e9\u30d9\u30eb\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10046JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u542b\u307e\u308c\u308b\u5168\u8981\u7d20\u306f\u3001\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u8868\u793a\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10048JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u8868\u793a\u30ea\u30f3\u30af\u306e\u8981\u7d20\u306b\u306forder\u5c5e\u6027\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u7279\u306b\u3001\u540c\u3058\u8981\u7d20\u304c\u4e00\u3064\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306e\u540c\u3058\u968e\u5c64\uff08\u30c4\u30ea\u30fc\uff09\u306e\u4e0b\u306b\u8907\u6570\u51fa\u308b\u5834\u5408\u3001order\u5c5e\u6027\u306e\u8a2d\u5b9a\u3092\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10049JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u8868\u793a\u30ea\u30f3\u30af\u306b\u512a\u5148\u30e9\u30d9\u30eb\uff08preferredLabel\uff09\u3092\u8a2d\u5b9a\u3059\u308b\u5834\u5408\u3001\u30e9\u30d9\u30eb\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u5bfe\u5fdc\u3059\u308b\u30e9\u30d9\u30eb\u306e\u8a2d\u5b9a\u304c\u5fc5\u9808\u3067\u3059\u3002\u540c\u3058\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u4e00\u3064\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u540c\u3058\u968e\u5c64\u306b\u8907\u6570\u51fa\u308b\u5834\u5408\u3001\u9055\u3046\u512a\u5148\u30e9\u30d9\u30eb\u3092\u8a2d\u7f6e\u3057\u307e\u3059\u3002
EVA_10050JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u8a08\u7b97\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u306forder\u3068weight\u3092\u8a2d\u5b9a\u3059\u308b\u3002
EVA_10051JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u8a08\u7b97\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u5185\u306e\u540c\u4e00\u89aa\u5b50\u8a08\u7b97\u95a2\u4fc2\u306e\u89aa\u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u5b50\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u306f\u540c\u3058\u671f\u9593\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10054JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u5b9a\u7fa9\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u306forder\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10055JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u5b9a\u7fa9\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u30c9\u30e1\u30a4\u30f3\u30a8\u30ec\u30e1\u30f3\u30c8\u4ee5\u5916\u300c\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3-\u30c9\u30e1\u30a4\u30f3\u300d\u3068\u300c\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3-\u30c7\u30d5\u30a9\u30eb\u30c8\u300d\u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10056JP=\u4f01\u696d\u62e1\u5f35\u30bf\u30af\u30bd\u30ce\u30df\u306e\u5b9a\u7fa9\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u306f\u3001\u5404\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3\u30c6\u30fc\u30d6\u30eb\u3092\u72ec\u7acb\u3057\u305f\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306b\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10057JP=\u4f01\u696d\u62e1\u5f35\u3057\u305f\u53c2\u7167\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10060JP=\u4f01\u696d\u304c\u5b9a\u7fa9\u3057\u305fELR\u306e\u30ed\u30fc\u30ebURI\u306e\u547d\u540d\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u30c9\u30e1\u30a4\u30f3\uff5d/role/cas/{6XXXXX}{\u30a2\u30eb\u30d5\u30a1\u30d9\u30c3\u30c8\u5c0f\u6587\u5b57}\u3002
EVA_10061JP=\u4f01\u696d\u304c\u5b9a\u7fa9\u3057\u305fELR\u306edefine\u306e\u547d\u540d\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u7f16\u7801\uff5d\uff5b\u8d22\u52a1\u4fe1\u606f\u4e3b\u9898\uff5d\u3002
EVA_10063JP=\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u306e\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306e\u76f4\u63a5\u4fee\u6b63\u306f\u7981\u6b62\u3055\u308c\u3066\u3044\u307e\u3059\u3002
EVA_10064JP=\u62e1\u5f35\u3057\u305f\u8868\u793a\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306b\u306f\u3001\u8ca1\u52d9\u5831\u544a\u30d5\u30c3\u30c8\u30ce\u30fc\u30c8\u306e\u56db\u7d1a\u3067\u8981\u6c42\u3055\u308c\u308b\u5404\u30e9\u30d9\u30eb\u306eELR\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10065JP=ELR\u306b\u5bfe\u3057\u3066\u3001\u30ed\u30fc\u30eb\u30bf\u30a4\u30d7\uff08roleType\uff09\u3001\u552f\u4e00\u306eroleURI\u3001id\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u6a19\u6e96\u30bf\u30af\u30bd\u30ce\u30df\u3068\u306f\u91cd\u8907\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10066JP=\u4f01\u696d\u304c\u5b9a\u7fa9\u3057\u305fELR\u306e\u547d\u540d\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u30c9\u30e1\u30a4\u30f3\uff5d/role/cas/\uff5b\u756a\u53f7\uff11\uff5d/\uff5b\u756a\u53f7\uff12\uff5d\uff5b\u756a\u53f7\uff13\uff5d
EVA_10067JP=\u5b9a\u7fa9\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u306e\u547d\u540d\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b[\u756a\u53f7]\uff5d\uff5b\u8ca1\u52d9\u5831\u544a\u8868\u73fe\u30ec\u30d9\u30eb\uff5d-\uff5b\u8ca1\u52d9\u60c5\u5831\u30bf\u30a4\u30c8\u30eb\uff5d\u3002
EVA_10069JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u547d\u540d\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\uff5b\u4f01\u696d\u4e2d\u56fd\u8a9e\u540d\u79f0\uff5d-\uff5b\u30d3\u30b8\u30cd\u30b9\u884c\u653f\u7ba1\u7406\u756a\u53f7\uff5d-\uff5b\u65e5\u4ed8\uff5d. \uff5b\u62e1\u5f35\u5b50\uff5d
EVA_10074JP=\u8ca1\u52d9\u5831\u544a\u306e\u30d8\u30c3\u30c0\u30fc\u3001\u30d5\u30c3\u30bf\u30fc\u60c5\u5831\u3001\u5358\u4f4d\u540d\u79f0\u3001\u30da\u30fc\u30b8\u756a\u53f7\u7b49\u306f\u3001\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f\u8a18\u8f09\u3057\u307e\u305b\u3093\u3002
EVA_10075JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5831\u544a\u9805\u76ee\u306f\u91cd\u8907\u8a18\u8f09\u3067\u304d\u307e\u305b\u3093\u3002\uff11\u3064\u306e\u5831\u544a\u9805\u76ee\u306b\u5bfe\u3057\u3066\u3001\u552f\u4e00\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\uff08context\uff09\u3001\u5358\u4f4d\uff08unit\uff09\u3001\u8a00\u8a9e\uff08Lang\uff09\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u6301\u3064\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10077JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4f01\u696d\u8b58\u5225\u5b50\uff08Identifier\uff09\u306b\u306f\u300c\u30d3\u30b8\u30cd\u30b9\u884c\u653f\u7ba1\u7406\u756a\u53f7\u300d\u3001Schema\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u306f\u5de5\u5546\u7ba1\u7406\u5c40\u306e\u30c9\u30e1\u30a4\u30f3\uff08http://www.saic.gov.cn/\uff09\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10078JP=\u4f01\u696d\u540d\u79f0\u3068\u65e5\u4ed8\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u9805\u76ee\u30bf\u30a4\u30d7\uff08domainItemType\uff09\u4ee5\u5916\u306e\u30c7\u30fc\u30bf\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u8868\u793a\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10079JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u672a\u4f7f\u7528\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10080JP=Dimension\u306eContext\u306b\u306fscenario\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002segment\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10081JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u672a\u4f7f\u7528\u306eUnit\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10082JP=\u767e\u5206\u6bd4\u3092\u793a\u3059\u6570\u5b57\u306b\u306f\u300c%\u300d\u306f\u542b\u3081\u305a\u3001\u5c0f\u6570\u3067\u6bd4\u7387\u6570\u5b57\u3092\u8868\u793a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u4f8b\uff1a20%\u306e\u5834\u5408\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u306f0.2\u3092\u8a18\u8f09\u3057\u307e\u3059\u3002
EVA_10084JP=Dimension\u8981\u7d20\u3068Domain\u8981\u7d20\u306f\u6df7\u7528\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10085JP=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u4e2d\u306e\u65e5\u4ed8\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\uff1a\u300cyyyy-mm-dd\u300d\u3002
EVA_10087JP=Context\u306eperiod\u8981\u7d20\u306b\u304a\u3044\u3066\u3001startDate\u8981\u7d20\u3068\u4e00\u81f4\u3059\u308bendDate\u8981\u7d20\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10088JP=Context\u306eperiod\u8981\u7d20\u306b\u306f\u3001startDate\u8981\u7d20\u3068instant\u8981\u7d20\u3092\u540c\u6642\u306b\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10089JP=\u62bd\u8c61\u8981\u7d20\u306eabstract\u5c5e\u6027\u306ftrue\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10090JP=\u30c9\u30e1\u30a4\u30f3\u30e1\u30f3\u30d0\u30fc\u8981\u7d20\u306fabstract=true\u3001periodType=duration\u3001type=domainItemType\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10091JP=\u8868\u8981\u7d20\u306fsubstitutionGroup=hypercubeItem\u3001\u8ef8\u8981\u7d20\u306fsubstitutionGroup=dimensionitem\u3001\u4e8c\u3064\u3068\u3082\u306btype=stringItemType\u3001periodType=duration\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10092JP=\u540c\u3058\u8981\u7d20\u306b\u5bfe\u3057\u3066\u4e2d\u56fd\u8a9e\u3068\u82f1\u8a9e\u306e\u30e9\u30d9\u30eb\u3092\u6301\u3064\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u82f1\u8a9e\u30e9\u30d9\u30eb\u306f\u30cf\u30f3\u30d7\u898f\u5247\u306b\u5f93\u3046\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10094JP=\u30c6\u30ad\u30b9\u30c8\u30d6\u30ed\u30c3\u30af\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u540d\u306f[text block]\u3067\u7d42\u4e86\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10095JP=\u8ef8\u8981\u7d20\uff08substitutionGroup=dimensionItem\uff09\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u540d\u306f[axis]\u3067\u7d42\u4e86\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10096JP=\u8868\u8981\u7d20\uff08substitutionGroup=hypercubeItem\uff09\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u540d\u306f[table]\u3067\u7d42\u4e86\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10097JP=\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306b\u306f6\u6841\u306e\u30b3\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
EVA_10098JP=\u8ca1\u52d9\u30ec\u30dd\u30fc\u30c8\u306e\u4e00\u822c\u60c5\u5831\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c1\u30012,3\u6841\u76ee\u306f\u5275\u520a\u57fa\u6e96\u30b3\u30fc\u30c9\u30014,5\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30016\u6841\u76ee\u306f\u9023\u7d50\uff1a0\u3001\u500b\u5225\uff1a5\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10099JP=\u8cc7\u7523\u8ca0\u50b5\u8868\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c2\u30012,3\u6841\u76ee\u306f\u5275\u520a\u57fa\u6e96\u30b3\u30fc\u30c9\u30014,5\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30016\u6841\u76ee\u306f\u9023\u7d50\uff1a0\u3001\u500b\u5225\uff1a5\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10100JP=\u5229\u6f64\u8868\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c1\u30012,3\u6841\u76ee\u306f\u5275\u520a\u57fa\u6e96\u30b3\u30fc\u30c9\u30014,5\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30016\u6841\u76ee\u306f\u9023\u7d50\uff1a0\u3001\u500b\u5225\uff1a5\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10101JP=\u73fe\u91d1\u6d41\u91cf\u8868\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c1\u30012,3\u6841\u76ee\u306f\u5275\u520a\u57fa\u6e96\u30b3\u30fc\u30c9\u30014,5\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30016\u6841\u76ee\u306f\u9023\u7d50\uff1a0\u3001\u500b\u5225\uff1a5\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10102JP=\u6240\u6709\u8005\u6a29\u76ca\u5909\u52d5\u8868\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c1\u30012,3\u6841\u76ee\u306f\u5275\u520a\u57fa\u6e96\u30b3\u30fc\u30c9\u30014,5\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30016\u6841\u76ee\u306f\u9023\u7d50\uff1a0\u3001\u500b\u5225\uff1a5\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10103JP=\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3\u306e\u62e1\u5f35\u30ea\u30f3\u30af\u30ed\u30fc\u30eb\u306f1\u6841\u76ee\u304c9\u30012,3\u6841\u76ee\u306f\u30b8\u30e3\u30f3\u30d7\u30b3\u30fc\u30c9\u30014,5,6\u6841\u76ee\u306f0\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10104JP=CAS\u3067\u306fExplicit dimension\u3092\u63a1\u7528\u3057\u3001Typed dimension\u306f\u4f7f\u7528\u3057\u307e\u305b\u3093\u3002
EVA_10105JP=\u8a08\u7b97\u30ea\u30f3\u30af\u30d9\u30fc\u30b9\u3067\u306fabstract\u8981\u7d20\u306f\u51fa\u73fe\u305b\u305a\u3001\u307e\u305f\u3001preferredLabel\u306e\u8a2d\u5b9a\u3082\u884c\u306a\u3044\u307e\u305b\u3093\u3002
EVA_10106JP=\u5408\u8a08\u30e9\u30d9\u30eb\u306e\u5148\u982d\u306fTotal\u3067\u59cb\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10107JP=\u7d14\u984d\u30e9\u30d9\u30eb\u306e\u5148\u982d\u306fNet\u307e\u305f\u306fAggregated\u3067\u59cb\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10108JP=\u8981\u7d20\u3092\u62e1\u5f35\u3057\u305f\u5834\u5408\u3001\u62e1\u5f35\u3057\u305f\u8981\u7d20\u306f\u8868\u793a\u30ea\u30f3\u30af\u3001\u5b9a\u7fa9\u30ea\u30f3\u30af\u3001\u8a08\u7b97\u30ea\u30f3\u30af\u306e\u4f55\u308c\u304b\u307e\u305f\u306f\u5168\u3066\u306b\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10109JP=type=monetaryItemType\u306e\u8981\u7d20\u306b\u6587\u5b57\u578b\u306e\u30c7\u30fc\u30bf\u306f\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10110JP=\u8981\u7d20\u306b\u5b9a\u7fa9\u3055\u308c\u305fperiodType\u3068\u3001Context\u306ePeriod\u60c5\u5831\u306f\u4e00\u81f4\u3055\u305b\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10111JP=\u30e9\u30d9\u30eb\u540d\u306b\u4f7f\u7528\u3067\u304d\u306a\u3044\u6587\u5b57\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\uff1a\uff1f  |  >  <  :  *  +  \u201d  ;  =  .  &  !  @  #  {  }
EVA_10112JP=\u30e9\u30d9\u30eb\u540d\u306b\u4f7f\u7528\u3067\u304d\u308b\u6587\u5b57\uff1a\u6f22\u5b57\u3001A-Z\u3001a-z\u30010-9\u3001\uff08\uff0c\uff09\u3001\u30b3\u30f3\u30de\u3001-\u3001\u2019\u3001\u30b9\u30da\u30fc\u30b9\u3001[ ]\u3001/
EVA_10113JP=\u82f1\u8a9e\u30e9\u30d9\u30eb\u306e\u5148\u982d\u306f\u5927\u6587\u5b57\u3001\u4ed6\u306f\u7279\u5225\u306a\u540d\u79f0\u3068\u7565\u8a9e\u3092\u9664\u3044\u3066\u5c0f\u6587\u5b57\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u82f1\u8a9e\u30e9\u30d9\u30eb\u306b\u306f\u51a0\u8a5e"The"\u3001"An"\u3001"A"\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10114JP=\u30e9\u30d9\u30eb\u306e\u5148\u982d\u3068\u672b\u5c3e\u306b\u306f\u30b9\u30da\u30fc\u30b9\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u307e\u305f\u3001\u30e9\u30d9\u30eb\u4e2d\u306b\u306f\u9023\u7d9a\u30b9\u30da\u30fc\u30b9\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
EVA_10115JP=\u30e9\u30d9\u30eb\u540d\u3067XBRL\u3068\u306e\u307f\u95a2\u9023\u3059\u308b\u90e8\u5206\u306f[ ]\u3092\u4f7f\u7528\u3057\u3066\u5206\u5272\u3059\u308b\u5fc5\u8981\u304c\u3042\u3042\u308a\u307e\u3059\u3002
EVA_10116JP=hypercubes\u3001dimensions\u307e\u305f\u306fdomainmembers\u8981\u7d20\u3092\u9664\u304d\u3001\u4ed6\u306eabstract\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u306f[abstract]\u307e\u305f\u306f[line items]\u3092\u672b\u5c3e\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10117JP=type=escapedItemType\u3067\u3042\u308b\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u306f[text block]\u3092\u672b\u5c3e\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10118JP=\u30bf\u30a4\u30d7\u304cdimension\u3067\u3042\u308b\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u306f[axis]\u3092\u672b\u5c3e\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10119JP=\u30bf\u30a4\u30d7\u304chypercube\u3067\u3042\u308b\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u306f[table]\u3092\u672b\u5c3e\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
EVA_10120JP=\u30bf\u30a4\u30d7\u304cdomain members\u3067\u3042\u308b\u8981\u7d20\u306e\u6a19\u6e96\u30e9\u30d9\u30eb\u306f[member]\u3092\u672b\u5c3e\u3068\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

#validation err msg EN
EVA_00001=Reading schema file of settings information fail.
EVA_00002=Reading settings information fail.
EVA_00003=Settnigs information file define wrong.
EVA_00004=Reading schema file of rule set fail.
EVA_00005=Reading rule set fail.
EVA_00006=Rule set file define wrong.
EVA_00007=Reading settings information file fail.
EVA_00008=Reading validation component fail.
EVA_10003=Don't meet the Requirements of China National Technical Reference(GB/T25500-2010),Standard taxonomy and Enterprise Accounting Standards Basis taxonomy Guideline.
EVA_10004=Must follow the latest XBRL Technology Standard and Original edited Standard taxonomy.
EVA_10005=Encoding of Instance and taxonomy must be UTF-8.
EVA_10006=Format of expanded taxonomy's namespace:{Enterprise domain name/Basis of accounting/Date}.
EVA_10007=Expanded taxonomy must include schema of expanded taxonomy and link-based.
EVA_10008=When expanded by standard taxonomy,any contents in Toxonomy can't be added,modified,deleted.
EVA_10012=All contents of Comments must express in one text block(XML<text block>tag).
EVA_10013=Accounting Policies and  Accounting Estimated annotation must express in one text block(XML<text block>tag).
EVA_10018=Format of of enterprise expanded taxonomy schema file name:{Chinese name of business corporation }-{Administration for Industry and Commerce Registration No.}-{Date}.xsd.
EVA_10019=In the title of enterprise financial report,item elements which dataType is stringItemType and abstract is true could be used.
EVA_10020=The meaning of element which is same as standard Toxonomy's can't define repeatly.
EVA_10024=In the enterprise taxonomy,elements which not use in instance can't be defined.
EVA_10025=Period property of element and period(instant/duration) of Financial report must be same.
EVA_10029=Element name which follow camel Nomenclature is based on English standard label.
EVA_10031=Name of expanded elements mustn't be same as name of taxonomy element.
EVA_10032=In all of elements,property nillable is true.
EVA_10033=In all of virtual elements except elements of domain members,property type is stringItem,property abstract is true,property period is duration.
EVA_10034=Property of element's substitutionGroup must be dimensionItem or hypercubeItem or item.
EVA_10035=The name of Axis elements which property substitutionGroup is dimensionItem and abstract is true must end with Axis.
EVA_10036=The name of Table elements which property substitutionGroup is hypercubeItem and abstract is true must end with Table.
EVA_10037=The name of line item elements which property abstract is true must end with LineItems.
EVA_10038=The name of domain member elements which property type is domainItem and abstract is true must end with Member.
EVA_10039=Format of link-based file name:{Enterprise legal Chinese name}-{Administration for Industry and Commerce Registration No.}-{Date}[_{link-based type}][_{language type}].xml
EVA_10040=When enterprise define element label itself,elements use same language only have one xlink:role.
EVA_10041=The name of element's standard label must be unique,standard label of different elements must be different.
EVA_10045=For the same element,both of Chinese label and English label must be defined.
EVA_10046=All of elements of instance must be defined in link-based of enterprise expanded taxonomy.
EVA_10048=Enterprise expanded taxonomy's link-based should set property order for elements.When the element appear repeatly in the same level of same expanded linked role,it should have different value of order.
EVA_10049=In enterprise expanded taxonomy's presentation link-based,if a element have seted preferredLabel, label of relevant label role should be define in label linked for the element.When the element appear repeatly in the same level of same expanded linked role,it should be setted different preferredLabel in presentation link-based.
EVA_10050=In enterprise expanded taxonomy's calculation link-based,propery order and property weight should be set for element.
EVA_10051=In enterprise expanded taxonomy's calculation link-based,parent element and child element which belong to the same calculation relationship should have the same property period.
EVA_10054=In enterprise expanded taxonomy's definition link-based,property order should be setted for element.
EVA_10055=In enterprise expanded taxonomy's definition link-based,property dimension-domain and property dimension-default are only setted for domain element.
EVA_10056=In enterprise expanded taxonomy's definition link-based,every dimension table should be put in the single expanded link role.
EVA_10057=Enterprise expanded taxonomy link-based do can't include Reference link-based.
EVA_10060=Format of enterprise'definition'ELR'roleURI:{enterprise internet domain name}/role/cas/{6XXXXX}{lowcase alphabet}.
EVA_10061=Format of enterprise'definition'ELR'limited element:{number}{Financial information title}.
EVA_10063=Standard taxonomy's link-based can't modify directly.
EVA_10064=In expanded presentation link-based,expanded link role should be defined independent by every level which define four level in financial report.
EVA_10065=Enterprise should define element roleType for expanded link role,ande the roleURI and id of roleType muse be unique,not same as standard taxonomy.
EVA_10066=Format of enterprise'definition'ELR:{enterprise internet domain name}/role/cas/{number1}/{number2}{number3}
EVA_10067=Format of definition's link base:{[number]}{level of financial reporting mark}-{financial information title}.
EVA_10069=Format of instance file:{Enterprise legal Chinese name}-{Administration for Industry and Commerce Registration No.}-{Date}.{File extension}.
EVA_10074=Information of header or footer, Enterprise name,page number in Financial report can't show in instace.
EVA_10075=Instance can't mark on the same report.The mark on the report must have unique element,unique context,unique Unit,unit Lang.
EVA_10077=Instance's identifier must is Administration for Industry and Commerce Registration No.Schema property must is Administration for Industry and Commerce's damain(http://www.saic.gov.cn/).
EVA_10078=Enterprise name and date only appear in domainItemType of element.
EVA_10079=Instance can't include context not in use.
EVA_10080=Context of Dimension must use Scenario,not use Segment.
EVA_10081=Instance can't include Unit not in use.
EVA_10082=Percentage figure don't include a percent sign,it represent by form of decimal.ex:20% represented as 0.2.
EVA_10084=Can't use Dimension and Domain mixed.
EVA_10085=Format of date in instance:[yyyy-mm-dd].
EVA_10087=In period of context,value of startDate can't equal with value of endDate.
EVA_10088=In period of context,can't set startDate and instant at the same time.
EVA_10089=Abstract element's abstract property must set true.
EVA_10090=Domain member's element abstract must be true,periodType must be duration,type must be domainItemType.
EVA_10091=Table's substitutionGroup must be hypercubeItemType.Axis's substitutionGroup must be dimensionItemType.Their type must be stringItemType and their periodType must be duration.
EVA_10092=One element should have Chinese label and English label.English label follow hump rule.
EVA_10094=Textblock's standard label name must end with [text block].
EVA_10095=Aixs element(substitutionGroup=dimensionItem)'s standard label name must end with [axis].
EVA_10096=Table element(substitutionGroup=hypercubeItem)'s standard label name must end with [table].
EVA_10097=Enpanded link role must be 6 bits.
EVA_10098=Finacial report's common information's expanded link roll's first number is 1,second and third number are launch criteria number,fourth and fifth number are jump number.If it's merged report,sixth number is 0.If it's specific report,sixth number is 5.
EVA_10099=Balance Sheet's common information's expanded link roll's first number is 2,second and third number are launch criteria number,fourth and fifth number are jump number.If it's merged report,sixth number is 0.If it's specific report,sixth number is 5.
EVA_10100=Income Statement's common information's expanded link roll's first number is 1,second and third number are launch criteria number,fourth and fifth number are jump number.If it's merged report,sixth number is 0.If it's specific report,sixth number is 5.
EVA_10101=Cash Flows Statement's common information's expanded link roll's first number is 1,second and third number are launch criteria number,fourth and fifth number are jump number.If it's merged report,sixth number is 0.If it's specific report,sixth number is 5.
EVA_10102=The statement of equity ownership 's common information's expanded link roll's first number is 1,second and third number are launch criteria number,fourth and fifth number are jump number.If it's merged report,sixth number is 0.If it's specific report,sixth number is 5.
EVA_10103=The statement of equity ownership 's common information's expanded link roll's first number is 1,second and third number are launch criteria number,fourth and fifth and sixth number are 0.
EVA_10104=Standard Taxonomy use Explicit dimension,not use Typed dimension.
EVA_10105=Calculation link base don't exist abstract element and don't set preferred labels.
EVA_10106=Total label must start with Total.
EVA_10107=Net label must start with Net or Aggregated.
EVA_10108=After expand element,presentation link,definition link and calculation link must be define for it.
EVA_10109=When type is monetaryItemType,can't set string data type for it.
EVA_10110=The periodType and the context's Period info must be same.
EVA_10111=Following symbol label can't include:?  |  >  <  :  *  +  "  ;  =  .  &  !  @  #  {  }
EVA_10112=Following symbol label can include:Chinese character,A-Z,a-z,0-9,(,),Comma,-,',space,[ ],/
EVA_10113=First letter of English label must capital.First letter of Special name and Abbreviations must capital.English label can't include "The","An","A".
EVA_10114=Label can't start with space or end with space,can't have Continuous space in the middle.
EVA_10115=If label is related to XBRL,isn't related to Accounting Standards and Regulatory requirements.It seperated by space.
EVA_10116=Except for hypercubes,dimensions and domain members,other abstract elment's standard label must end with [abstract] or [line items].
EVA_10117=The standard label of element which type is escapedItemType must end with [text block].
EVA_10118=The standard label of element which type is dimension must end with [axis].
EVA_10119=The standard label of element which type is hypercube must end with [table].
EVA_10120=The standard label of element which type is domain members must end with [member].
